OKMCU/free-serial-bootloader/bsp/GD32E232x8/Firmware/GD32E232_standard_peripheral/Source/gd32e232_cla.c
/*!
    \file    gd32e232_cla.c
    \brief   CLA driver
    
    \version 2019-05-15, V1.0.0, firmware for GD32E232
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e232_cla.h"

/*!
    \brief      reset CLA
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cla_deinit(void)
{
    rcu_periph_reset_enable(RCU_CLARST);
    rcu_periph_reset_disable(RCU_CLARST);
}

/*!
    \brief      enable CLA
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void cla_enable(cla_enum cla_periph)
{
    switch(cla_periph){
        case CLA0:
             CLA_GCTL |= CLA_GCTL_CLA0EN;
             break;
        case CLA1:
             CLA_GCTL |= CLA_GCTL_CLA1EN;
             break;
        case CLA2:
             CLA_GCTL |= CLA_GCTL_CLA2EN;
             break;
        case CLA3:
             CLA_GCTL |= CLA_GCTL_CLA3EN;
             break;
        default: 
             break;
    }
}

/*!
    \brief      disable CLA
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void cla_disable(cla_enum cla_periph)
{
    switch(cla_periph){
        case CLA0:
             CLA_GCTL &= (~CLA_GCTL_CLA0EN);
             break;
        case CLA1:
             CLA_GCTL &= (~CLA_GCTL_CLA1EN);
             break;
        case CLA2:
             CLA_GCTL &= (~CLA_GCTL_CLA2EN);
             break;
        case CLA3:
             CLA_GCTL &= (~CLA_GCTL_CLA3EN);
             break;
        default: 
             break;
    }
}

/*!
    \brief      get CLA output state
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[out] none
    \retval     cla_outputstatus_enum: CLA_OUTPUT_HIGH or CLA_OUTPUT_LOW
*/
cla_outputstatus_enum cla_output_state_get(cla_enum cla_periph)
{
    uint32_t state;
    uint32_t returnval;
    
    /* read cla status register */
    state = CLA_STAT;
    
    switch(cla_periph){
        case CLA0:
             returnval = (state & CLA_STAT_CLA0OUT);
             break;
        case CLA1:
             returnval = ((state & CLA_STAT_CLA1OUT)>>1);
             break;
        case CLA2:
             returnval = ((state & CLA_STAT_CLA2OUT)>>2);
             break;
        case CLA3:
             returnval = ((state & CLA_STAT_CLA3OUT)>>3);
             break;
        default: 
             break;
    }
    if(CLA_OUTPUT_HIGH == returnval){
        return CLA_OUTPUT_HIGH;
    }else{
        return CLA_OUTPUT_LOW;
    }
}

/*!
    \brief      configure multiplexer input
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[in]  mux: multiplexer
                only one parameter can be selected which is shown as below:
                MUX0: multiplexer 0
                MUX1: multiplexer 1
    \param[in]  input: input of multiplexer

     MUX0 input selection:
     only one parameter can be selected which is shown as below:
     --------------------------------------------------------------------------------------------------------------------------
     | MUX0[3:0]|      CLA0MUX0             |      CLA1MUX0             |      CLA2MUX0             |     CLA3MUX0            |
     --------------------------------------------------------------------------------------------------------------------------
     |   0000   | CLA0MUX0_CLA0_ASYNC_OUT   | CLA0MUX0_CLA3_ASYNC_OUT   | CLA0MUX0_CLA3_ASYNC_OUT   | CLA0MUX0_CLA3_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------
     |   0001   | CLA1MUX0_CLA1_ASYNC_OUT   | CLA1MUX0_CLA1_ASYNC_OUT   | CLA1MUX0_CLA1_ASYNC_OUT   | CLA1MUX0_CLA1_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------
     |   0010   | CLA2MUX0_CLA2_ASYNC_OUT   | CLA2MUX0_CLA2_ASYNC_OUT   | CLA2MUX0_CLA2_ASYNC_OUT   | CLA2MUX0_CLA2_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------
     |   0011   | CLA3MUX0_CLA3_ASYNC_OUT   | CLA3MUX0_CLA3_ASYNC_OUT   | CLA3MUX0_CLA3_ASYNC_OUT   | CLA3MUX0_CLA3_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------
     |   0100   | CLA0MUX0_TIMER1_TRGO      | CLA1MUX0_TIMER1_TRGO      | CLA2MUX0_TIMER1_TRGO      | CLA3MUX0_TIMER1_TRGO    |
     --------------------------------------------------------------------------------------------------------------------------
     |   0101   | CLA0MUX0_TIMER0_CH0       | CLA1MUX0_TIMER0_CH0       | CLA2MUX0_TIMER0_CH1       | CLA3MUX0_TIMER0_CH2     |
     --------------------------------------------------------------------------------------------------------------------------
     |   0110   | CLA0MUX0_TIMER0_CH1       | CLA1MUX0_TIMER0_CH3       | CLA2MUX0_TIMER0_CH3       | CLA3MUX0_TIMER1_CH0     |
     --------------------------------------------------------------------------------------------------------------------------
     |   0111   | CLA0MUX0_TIMER0_CH2       | CLA1MUX0_TIMER1_CH0       | CLA2MUX0_TIMER1_CH1       | CLA3MUX0_TIMER1_CH1     |
     --------------------------------------------------------------------------------------------------------------------------
     |   1000   | CLA0MUX0_CLAIN0           | CLA1MUX0_CLAIN4           | CLA2MUX0_CLAIN0           | CLA3MUX0_CLAIN2         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1001   | CLA0MUX0_CLAIN2           | CLA1MUX0_CLAIN5           | CLA2MUX0_CLAIN1           | CLA3MUX0_CLAIN3         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1010   | CLA0MUX0_CLAIN4           | CLA1MUX0_CLAIN8           | CLA2MUX0_CLAIN8           | CLA3MUX0_CLAIN6         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1011   | CLA0MUX0_CLAIN6           | CLA1MUX0_CLAIN10          | CLA2MUX0_CLAIN9           | CLA3MUX0_CLAIN7         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1100   | CLA0MUX0_CLAIN8           | CLA1MUX0_CLAIN12          | CLA2MUX0_CLAIN14          | CLA3MUX0_CLAIN10        |
     --------------------------------------------------------------------------------------------------------------------------
     |   1101   | CLA0MUX0_CLAIN10          | CLA1MUX0_CLAIN13          | CLA2MUX0_CLAIN15          | CLA3MUX0_CLAIN11        |
     --------------------------------------------------------------------------------------------------------------------------
     |   1110   | CLA0MUX0_CLAIN12          | CLA1MUX0_CLAIN16          | CLA2MUX0_CLAIN16          | CLA3MUX0_CLAIN18        |
     --------------------------------------------------------------------------------------------------------------------------
     |   1111   | CLA0MUX0_CLAIN14          | CLA1MUX0_CLAIN18          | CLA2MUX0_CLAIN17          | CLA3MUX0_CLAIN19        |
     --------------------------------------------------------------------------------------------------------------------------
     MUX1 input selection:
     only one parameter can be selected which is shown as below:
     --------------------------------------------------------------------------------------------------------------------------
     | MUX1[3:0]|      CLA0MUX1             |      CLA1MUX1             |       CLA2MUX1            |     CLA3MUX1            |
     --------------------------------------------------------------------------------------------------------------------------
     |   0000   | CLA0MUX1_CLA0_ASYNC_OUT   | CLA0MUX1_CLA0_ASYNC_OUT   | CLA0MUX1_CLA0_ASYNC_OUT   | CLA0MUX1_CLA0_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------
     |   0001   | CLA1MUX1_CLA1_ASYNC_OUT   | CLA1MUX1_CLA1_ASYNC_OUT   | CLA1MUX1_CLA1_ASYNC_OUT   | CLA1MUX1_CLA1_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------
     |   0010   | CLA2MUX1_CLA2_ASYNC_OUT   | CLA2MUX1_CLA2_ASYNC_OUT   | CLA2MUX1_CLA2_ASYNC_OUT   | CLA2MUX1_CLA2_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------
     |   0011   | CLA3MUX1_CLA3_ASYNC_OUT   | CLA3MUX1_CLA3_ASYNC_OUT   | CLA3MUX1_CLA3_ASYNC_OUT   | CLA3MUX1_CLA3_ASYNC_OUT |
     --------------------------------------------------------------------------------------------------------------------------
     |   0100   | CLA0MUX1_ADC_CONV         | CLA1MUX1_ADC_CONV         | CLA2MUX1_ADC_CONV         | CLA3MUX1_ADC_CONV       |
     --------------------------------------------------------------------------------------------------------------------------
     |   0101   | CLA0MUX1_TIMER0_CH3       | CLA1MUX1_TIMER0_CH1       | CLA2MUX1_TIMER0_CH0       | CLA3MUX1_TIMER0_CH0     |
     --------------------------------------------------------------------------------------------------------------------------
     |   0110   | CLA0MUX1_TIMER1_CH0       | CLA1MUX1_TIMER0_CH2       | CLA2MUX1_TIMER0_CH2       | CLA3MUX1_TIMER0_CH1     |
     --------------------------------------------------------------------------------------------------------------------------
     |   0111   | CLA0MUX1_TIMER2_CH1       | CLA1MUX1_TIMER2_CH1       | CLA2MUX1_TIMER1_CH0       | CLA3MUX1_TIMER0_CH3     |
     --------------------------------------------------------------------------------------------------------------------------
     |   1000   | CLA0MUX1_CLAIN1           | CLA1MUX1_CLAIN6           | CLA2MUX1_CLAIN2           | CLA3MUX1_CLAIN0         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1001   | CLA0MUX1_CLAIN3           | CLA1MUX1_CLAIN7           | CLA2MUX1_CLAIN3           | CLA3MUX1_CLAIN1         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1010   | CLA0MUX1_CLAIN5           | CLA1MUX1_CLAIN9           | CLA2MUX1_CLAIN10          | CLA3MUX1_CLAIN4         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1011   | CLA0MUX1_CLAIN6           | CLA1MUX1_CLAIN11          | CLA2MUX1_CLAIN11          | CLA3MUX1_CLAIN5         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1100   | CLA0MUX1_CLAIN9           | CLA1MUX1_CLAIN14          | CLA2MUX1_CLAIN12          | CLA3MUX1_CLAIN8         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1101   | CLA0MUX1_CLAIN11          | CLA1MUX1_CLAIN15          | CLA2MUX1_CLAIN13          | CLA3MUX1_CLAIN9         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1110   | CLA0MUX1_CLAIN11          | CLA1MUX1_CLAIN15          | CLA2MUX1_CLAIN13          | CLA3MUX1_CLAIN9         |
     --------------------------------------------------------------------------------------------------------------------------
     |   1111   | CLA0MUX1_CLAIN13          | CLA1MUX1_CLAIN17          | CLA2MUX1_CLAIN18          | CLA3MUX1_CLAIN16        |
     --------------------------------------------------------------------------------------------------------------------------
    \param[out] none
    \retval     none
*/
void cla_multiplexer_input_config(cla_enum cla_periph, cla_mux_enum mux, uint32_t input)
{
    if(MUX0 == mux){
        CLA_MUXS(cla_periph) &= (~CLA_MUXS_MUX0);
        CLA_MUXS(cla_periph) |= input;
    }else{
        CLA_MUXS(cla_periph) &= (~CLA_MUXS_MUX1);
        CLA_MUXS(cla_periph) |= input;
    }
}

/*!
    \brief      configure CLA LUT control register value
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[in]  value: the value need to set
    \param[out] none
    \retval     none
*/
void cla_lut_control_config(cla_enum cla_periph, uint8_t lutctl_value)
{
    CLA_LUTCTL(cla_periph) &= (~CLA_LUT);
    CLA_LUTCTL(cla_periph) |= LUTCTL(lutctl_value);
}

/*!
    \brief      configure CLA output
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[in]  output: output of CLA
                only one parameter can be selected which is shown as below:
                FLIP_FLOP_OUTPUT: flip-flop output is selected as CLA output
                LUT_RESULT: LUT result is selected as CLA output
    \param[out] none
    \retval     none
*/
void cla_output_config(cla_enum cla_periph, uint32_t output)
{
    CLA_CTL(cla_periph) &= (~CLA_CTL_OSEL);
    CLA_CTL(cla_periph) |= output;
}

/*!
    \brief      enable CLA output
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void cla_output_enable(cla_enum cla_periph)
{
    CLA_CTL(cla_periph) |= CLA_CTL_OEN;
}

/*!
    \brief      disable CLA output
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void cla_output_disable(cla_enum cla_periph)
{
    CLA_CTL(cla_periph) &= (~CLA_CTL_OEN);
}

/*!
    \brief      reset the flip-flop output asynchronuously
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void cla_flip_flop_output_reset(cla_enum cla_periph)
{
    CLA_CTL(cla_periph) |= CLA_CTL_FFRST;
}

/*!
    \brief      configure clock polarity of flip-flop
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[in]  polarity: clock polarity of flip-flop
                only one parameter can be selected which is shown as below:
                CLA_CLOCKPOLARITY_POSEDGE: clock posedge is valid
                CLA_CLOCKPOLARITY_NEGEDGE: clock negedge is valid
    \param[out] none
    \retval     none
*/
void cla_flip_flop_clockpolarity_config(cla_enum cla_periph, uint32_t polarity)
{
    CLA_CTL(cla_periph) &= (~CLA_CTL_CPOL);
    CLA_CTL(cla_periph) |= polarity;
}

/*!
    \brief      configure clock source of flip-flop 
    \param[in]  cla_periph: CLAx(x=0,1,2,3)
    \param[in]  clock_source: clock source of flip-flop
                only one parameter can be selected which is shown as below:
                PRE_CLA_LUT_RESULT: the result of the previous CLA units
                MUX0_OUTPUT: the multiplexer output of MUX0
                HCLK: HCLK
                TIMER_TRGO: TIMER_TRGO
    \param[out] none
    \retval     none
*/
void cla_flip_flop_clocksource_config(cla_enum cla_periph, uint32_t clock_source)
{
    CLA_CTL(cla_periph) &= (~CLA_CTL_CSEL);
    CLA_CTL(cla_periph) |= clock_source;
}

/*!
    \brief      check CLA flag is set or not
    \param[in]  flag: CLA flags,refer to cla_flag_enum
                only one parameter can be selected which is shown as below:
                CLA_FLAG_CLA0NF: CLA0 unit negedge flag
                CLA_FLAG_CLA0PF: CLA0 unit posedge flag
                CLA_FLAG_CLA1NF: CLA1 unit negedge flag
                CLA_FLAG_CLA1PF: CLA1 unit posedge flag
                CLA_FLAG_CLA2NF: CLA2 unit negedge flag
                CLA_FLAG_CLA2PF: CLA2 unit posedge flag
                CLA_FLAG_CLA3NF: CLA3 unit negedge flag
                CLA_FLAG_CLA3PF: CLA3 unit posedge flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus cla_flag_get(cla_flag_enum flag)
{
    uint32_t interrupt_flag_register;
    uint32_t returnval;
    
